using System;
using System.Collections.Generic;
using System.Text;

namespace HongMouer.EHR.Models
{
    /// <summary>
    /// 学位代码 GB/T 6864
    /// </summary>
    [Serializable]
    public enum EnumDegree
    {
        理学硕士学位 = 307,
        工学硕士学位 = 308,
        农学硕士学位 = 309,
        医学硕士学位 = 310,
        管理学硕士学位 = 312,
        法律硕士专业学位 = 341,
        教育硕士专业学位 = 342,
        工程硕士专业学位 = 343,
        临床学硕士专业学位 = 345,
        工商管理硕士专业学位 = 346,
        农业推广硕士专业学位 = 347,
        兽医硕士专业学位 = 348,
        公共管理硕士专业学位 = 349,
        公共卫生硕士专业学位 = 351,
        军事硕士专业学位 = 352,
        学士 = 4,
        哲学学士学位 = 401,
        经济学学士学位 = 402,
        教育学学士学位 = 404,
        文学学士学位 = 405,
        历史学学士学位 = 406,
        工学学士学位 = 408,
        农学学士学位 = 409,
        医学学士学位 = 410,
        军事学学士学位 = 411,
        建筑学学士专业学位 = 444,
        无 = 0,
        名誉博士 = 1,
        博士 = 2,
        法学博士学位 = 203,
        哲学博士学位 = 201,
        经济学博士学位 = 202,
        文学博士学位 = 205,
        历史学博士学位 = 206,
        理学博士学位 = 207,
        工学博士学位 = 208,
        医学博士学位 = 210,
        军事学博士学位 = 211,
        管理学博士学位 = 212,
        临床医学博士专业学位 = 245,
        硕士 = 3,
        哲学硕士学位 = 301,
        经济学硕士学位 = 302,
        法学硕士学位 = 303,
        教育学硕士学位 = 304,
        兽医博士专业学位 = 248,
        历史学硕士学位 = 306,
        军事学硕士学位 = 311,
        建筑学硕士专业学位 = 344,
        口腔医学硕士专业学位 = 350,
        法学学士学位 = 403,
        理学学士学位 = 407,
        管理学学士学位 = 412,
        教育学博士学位 = 204,
        农学博士学位 = 209,
        口腔医学博士专业学位 = 250,
        文学硕士学位 = 305,
    }
}
