using System;
using System.Collections.Generic;
using System.Text;

namespace HongMouer.EHR.Models.Enum
{

    /// <summary>
    /// 所学专业代码  GB/T 16835
    /// </summary>
    [Serializable]
    public enum EnumMajor
    {
        /// <summary>
        /// 哲学
        /// </summary>
        哲学 = 01,

        /// <summary>
        /// 哲学类
        /// </summary>
        哲学类 = 0101,

        /// <summary>
        /// 马克思主义基础
        /// </summary>
        马克思主义基础 = 010201,

        /// <summary>
        /// 经济学
        /// </summary>
        经济学 = 02,

        /// <summary>
        /// 经济学类
        /// </summary>
        经济学类 = 0201,

        /// <summary>
        /// 环境学
        /// </summary>
        环境学 = 071401,

        /// <summary>
        /// 心理学
        /// </summary>
        心理学 = 071501,

        /// <summary>
        /// 科技信息与管理类
        /// </summary>
        科技信息与管理类 = 0716,

        /// <summary>
        /// 管理科学
        /// </summary>
        管理科学 = 071601,

        /// <summary>
        /// 地矿学
        /// </summary>
        地矿学 = 0801,

        /// <summary>
        /// 地质矿产勘查
        /// </summary>
        地质矿产勘查 = 080101,

        /// <summary>
        /// 材料学
        /// </summary>
        材料学 = 0802,

        /// <summary>
        /// 钢铁冶金
        /// </summary>
        钢铁冶金 = 080201,

        /// <summary>
        /// 机械制造工艺与设备
        /// </summary>
        机械制造工艺与设备 = 080301,

        /// <summary>
        /// 仪器仪表类
        /// </summary>
        仪器仪表类 = 0804,

        /// <summary>
        /// 精密仪器
        /// </summary>
        精密仪器 = 080401,

        /// <summary>
        /// 热能核能类
        /// </summary>
        热能核能类 = 0805,

        /// <summary>
        /// 电工类
        /// </summary>
        电工类 = 0806,

        /// <summary>
        /// 电机电器及其控制
        /// </summary>
        电机电器及其控制 = 080601,

        /// <summary>
        /// 电子与信息类
        /// </summary>
        电子与信息类 = 0807,

        /// <summary>
        /// 电子材料与元器件
        /// </summary>
        电子材料与元器件 = 080701,

        /// <summary>
        /// 建筑学
        /// </summary>
        建筑学 = 080801,

        /// <summary>
        /// 水利类
        /// </summary>
        水利类 = 0809,

        /// <summary>
        /// 水文与水资源利用
        /// </summary>
        水文与水资源利用 = 080901,

        /// <summary>
        /// 测绘类
        /// </summary>
        测绘类 = 0810,

        /// <summary>
        /// /环境类
        /// </summary>
        环境类 = 0811,

        /// <summary>
        /// 环境工程
        /// </summary>
        环境工程 = 081101,

        /// <summary>
        /// 化工与制药类
        /// </summary>
        化工与制药类 = 0812,

        /// <summary>
        /// 化学工程
        /// </summary>
        化学工程 = 081201,

        /// <summary>
        /// 制糖工程
        /// </summary>
        制糖工程 = 081301,

        /// <summary>
        /// 农业工程类
        /// </summary>
        农业工程类 = 0814,

        /// <summary>
        /// 农业机械化
        /// </summary>
        农业机械化 = 081401,

        /// <summary>
        /// 林业工程类
        /// </summary>
        林业工程类 = 0815,

        /// <summary>
        /// 纺织类
        /// </summary>
        纺织类 = 0816,

        /// <summary>
        /// 纺织工程
        /// </summary>
        纺织工程 = 081601,

        /// <summary>
        /// 交通运输类
        /// </summary>
        交通运输类 = 0817,

        /// <summary>
        /// 交通运输
        /// </summary>
        交通运输 = 081701,

        /// <summary>
        /// 航空飞行器设计
        /// </summary>
        航空飞行器设计 = 081801,

        /// <summary>
        /// 兵器类
        /// </summary>
        兵器类 = 0819,

        /// <summary>
        /// 火炮与自动武器
        /// </summary>
        火炮与自动武器 = 081901,

        /// <summary>
        /// 公安技术类
        /// </summary>
        公安技术类 = 0820,
        工程力学类 = 0821,
        工程力学 = 082101,
        管理工程类 = 0822,
        管理工程 = 082201,
        植物生产类 = 0901,
        农学 = 090101,
        森林资源类 = 0902,
        林学 = 090201,
        园林 = 090301,
        动物生产与兽医类 = 0904,
        畜牧兽医 = 090401,
        水产类 = 0905,
        管理类 = 0906,
        农业经济管理 = 090601,
        农业推广类 = 0907,
        农业推广 = 090701,
        基础医学类 = 1001,
        基础医学 = 100101,
        预防医学类 = 1002,
        临床医学与医学技术类 = 1003,
        临床医学 = 100301,
        口腔医学类 = 1004,
        口腔医学 = 100401,
        中医学 = 100501,
        法医学类 = 1006,
        法医学 = 100601,
        护理学类 = 1007,
        药学类 = 1008,
        药学 = 100801,
        //管理类=1009	,
        //经济学=020101	,
        工商管理类 = 0202,
        法学 = 03,
        法学类 = 0301,
        //法学=030101	,
        社会学类 = 0302,
        政治学类 = 0303,
        政治学 = 030301,
        公安类 = 0304,
        警察管理 = 030401,
        教育学类 = 0401,
        教育学 = 040101,
        思想政治教育类 = 0402,
        体育学类 = 0403,
        体育教育 = 040301,
        职业技术教育类 = 0404,
        农艺教育 = 040401,
        文学 = 05,
        汉语言文学 = 050101,
        外国语言文学类 = 0502,
        英语 = 050201,
        新闻学类 = 0503,
        艺术类 = 0504,
        音乐学 = 050401,
        历史学 = 06,
        历史学类 = 0601,
        图书信息档案学类 = 0602,
        图书馆学 = 060201,
        理学 = 07,
        数学类 = 0701,
        物理学类 = 0702,
        物理学 = 070201,
        化学类 = 0703,
        生物科学类 = 0704,
        生物学 = 070401,
        新闻学 = 050301,
        //历史学=060101	,
        数学 = 070101,
        化学 = 070301,
        地质学类 = 0706,
        地球物理学类 = 0708,
        力学类 = 0711,
        材料科学类 = 0713,
        天文学类 = 0705,
        天文学 = 070501,
        地质学 = 070601,
        地理科学类 = 0707,
        地理学 = 070701,
        地球物理学 = 070801,
        大气科学类 = 0709,
        气象学 = 070901,
        海洋科学类 = 0710,
        海洋学 = 071001,
        理论与应用力学 = 071101,
        信息与电子科学类 = 0712,
        无线电物理学 = 071201,
        材料物理 = 071301,
        环境科学类 = 0714,
        马克思主义理论类 = 0102,
        工学 = 08,
        //哲学=010101	,
        心理学类 = 0715,
        机械学 = 0803,
        热能工程 = 080501,
        土建类 = 0808,
        大地测量 = 081001,
        轻工粮食食品类 = 0813,
        森林工程 = 081501,
        航空航天类 = 0818,
        防火工程 = 082001,
        //农学 = 09,
        环境保护类 = 0903,
        淡水渔业 = 090501,
        医学 = 10,
        预防医学 = 100201,
        中医学类 = 1005,
        护理学 = 100701,
        卫生事业管理 = 100901,
        企业管理 = 020201,
        社会学 = 030201,
        //教育学 = 04,
        思想政治教育 = 040201,
        中国语言文学类 = 0501,
    }
}
